In [25]:
import pandas as pd 
import matplotlib.pyplot as plt
import numpy as np 
import seaborn as sns
import os

In [26]:
path = os.path.normpath(os.getcwd() + os.sep + os.pardir)
print(path)

H:\Projects\NlP\NLP-Projects\Articles Classifer

In [27]:
ls

 Volume in drive H is Courses
 Volume Serial Number is 4408-8541

 Directory of H:\Projects\NlP\NLP-Projects\Articles Classifer\[1] Data Cleaning

06/12/2022  05:14 PM    <DIR>          .
06/12/2022  05:14 PM    <DIR>          ..
06/12/2022  03:27 PM    <DIR>          .ipynb_checkpoints
06/12/2022  05:14 PM         4,513,115 _finalCleaned.csv
06/12/2022  03:24 PM         2,061,042 Art.csv
06/12/2022  05:14 PM            21,476 code.ipynb
06/12/2022  03:24 PM         1,461,811 Economy.csv
06/12/2022  03:24 PM         1,239,608 Sports.csv
               5 File(s)      9,297,052 bytes
               3 Dir(s)  118,870,745,088 bytes free

In [28]:
art = pd.read_csv('Art.csv')
economy = pd.read_csv('Economy.csv')
sports = pd.read_csv('Sports.csv')
art.head()

   Unnamed: 0                                      Article Title Category
0           0  \n\nWorks by Picasso and others stolen in Spai...      Art
1           1  \n\nSalwa and Maged at the Art Corner Gallery ...      Art
2           2  \n\nA tribute to Abdalla Gohar\n\n\n\nOn 1 Dec...      Art
3           3  \n\nRaw, untamed, and compelling: ‘Flesh’ by S...      Art
4           4  \n\nFrom water to mosaics\n\n\n\nThe Gezira Ce...      Art

In [29]:
economy.head()

   Unnamed: 0                                      Article Title Category
0           0  \n\nChinese demand, Mideast turmoil boost ship...  economy
1           1  \n\nEgypt government to issue LE1 bn in zero c...  economy
2           2  \n\nFirst Egyptian Samsung factory starts prod...  economy
3           3  \n\nUPDATED: Egyptian and Arab stocks soar as ...  economy
4           4  \n\nGreek high school teachers to strike over ...  economy

In [30]:
data = pd.concat([art,economy,sports])
data = data.drop('Unnamed: 0',axis = 1)
data.head()

                                       Article Title Category
0  \n\nWorks by Picasso and others stolen in Spai...      Art
1  \n\nSalwa and Maged at the Art Corner Gallery ...      Art
2  \n\nA tribute to Abdalla Gohar\n\n\n\nOn 1 Dec...      Art
3  \n\nRaw, untamed, and compelling: ‘Flesh’ by S...      Art
4  \n\nFrom water to mosaics\n\n\n\nThe Gezira Ce...      Art

In [31]:
print(f'There are {data.shape[0]} Rows and {data.shape[1]} Columns in our Data')

There are 30437 Rows and 2 Columns in our Data

In [32]:
data['Article Title'] = data['Article Title'].str.strip()
data.head()

                                       Article Title Category
0  Works by Picasso and others stolen in Spain \n...      Art
1  Salwa and Maged at the Art Corner Gallery \n\n...      Art
2  A tribute to Abdalla Gohar\n\n\n\nOn 1 Decembe...      Art
3  Raw, untamed, and compelling: ‘Flesh’ by Samir...      Art
4  From water to mosaics\n\n\n\nThe Gezira Centre...      Art

In [33]:
data.drop_duplicates()

                                          Article Title Category
0     Works by Picasso and others stolen in Spain \n...      Art
1     Salwa and Maged at the Art Corner Gallery \n\n...      Art
2     A tribute to Abdalla Gohar\n\n\n\nOn 1 Decembe...      Art
3     Raw, untamed, and compelling: ‘Flesh’ by Samir...      Art
4     From water to mosaics\n\n\n\nThe Gezira Centre...      Art
...                                                 ...      ...
9975  Germany Bundesliga results & scorers (21st mat...   sports
9976  Barcelona go fourth after winning six-goal thr...   sports
9977  Dortmund humiliated by Leverkusen in Haaland's...   sports
9978  Back from injury, 1st Liverpool goal for teen ...   sports
9979  Manchester City, Chelsea, Spurs get favourable...   sports

[30371 rows x 2 columns]

In [36]:
data = data.replace('\n',' ',regex=True)

In [38]:
data.head()

                                       Article Title Category
0  Works by Picasso and others stolen in Spain   ...      Art
1  Salwa and Maged at the Art Corner Gallery     ...      Art
2  A tribute to Abdalla Gohar    On 1 December, K...      Art
3  Raw, untamed, and compelling: ‘Flesh’ by Samir...      Art
4  From water to mosaics    The Gezira Centre for...      Art

In [39]:
data.to_csv('_finalCleaned.csv')